In [1]:
import pandas as pd
import numpy as np

C:\Users\wq\AppData\Local\Temp\ipykernel_18024\2162656668.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [5]:
pp = {'city' : ['Tripoli','Tripoli','Rome','Rome','Sydney', 'Sydney'],
'rank': ['1st','2nd','1st','2nd','1st', '2nd'],
'name' : ['Noureddin', 'Adam', 'Kevin', 'Rihana', 'Raghad', 'Mahdi'],
'score1' : [44,48,39,41,38,44],
'score2': [67,63,55,70,64,77],
}

df = pd.DataFrame(pp, columns=['city', 'rank', 'name', 'score1', 'score2'])
df

      city rank       name  score1  score2
0  Tripoli  1st  Noureddin      44      67
1  Tripoli  2nd       Adam      48      63
2     Rome  1st      Kevin      39      55
3     Rome  2nd     Rihana      41      70
4   Sydney  1st     Raghad      38      64
5   Sydney  2nd      Mahdi      44      77

In [13]:
# set specific index
df.set_index(['city', 'rank'], drop=False, inplace=True)
df

                 city rank       name  score1  score2
city    rank
Tripoli 1st   Tripoli  1st  Noureddin      44      67
        2nd   Tripoli  2nd       Adam      48      63
Rome    1st      Rome  1st      Kevin      39      55
        2nd      Rome  2nd     Rihana      41      70
Sydney  1st    Sydney  1st     Raghad      38      64
        2nd    Sydney  2nd      Mahdi      44      77

In [16]:
df.index

MultiIndex([('Tripoli', '1st'),
            ('Tripoli', '2nd'),
            (   'Rome', '1st'),
            (   'Rome', '2nd'),
            ( 'Sydney', '1st'),
            ( 'Sydney', '2nd')],
           names=['city', 'rank'])